import React, { useState } from 'react';
import styles from "./ForthScreen.module.css";
import FAQItem from '../components/questions/Questions';
import Button from '../components/button/Button';
import both from "../images/זיו דנינו מיקרופיגמנטציה משולב.png"

const ForthScreen = () => {
  const faqData = [
    {
      question: "איך אני יכולה להיות בטוחה שהתוצאה תיראה טבעית ולא 'עשויה'?",
      answer: "על זה אני שמה את הדגש! אני עובדת עם מכשור מתקדם שלא חודר עמוק לעור, וזה מה שיוצר את המראה הטבעי. בנוסף, אני לא עובדת עם שבלונה - כל גבה מעוצבת בהתאם למבנה הפנים שלך."
    },
    {
      question: "האם הטיפול באמת לא כואב? אני מאוד רגישה לכאב",
      answer: "אני מבינה את הפחד הזה לגמרי! האמת שרוב הלקוחות שלי מופתעות כמה הטיפול לא כואב. יש לי לקוחות שצוחקות בזמן הטיפול ואפילו כאלה שנרדמות, בגבות זה ממש זניח, ובשפתיים אני יודעת לעבוד בצורה שגם שם זה נעים. המכשור שלי עדין והתוצאה שונה בהרבה מהשיטות המיושנות של פעם לצערי אפילו עובדים איתן עוד היום. לכן, שימי לב באיזו מאסטרית בוחרת לגבות שלך"
    },
    {
      question: "איך אני יודעת איזו שיטה מתאימה לי - שיטת השערה, פודרה או משולבת?",
      answer: "זה בדיוק למה יש לנו פגישת ייעוץ! אני בודקת את סוג העור שלך, את מבנה הגבות הקיימות ואת מה שאת רוצה להשיג. לדוגמה, שיטת השיערה פחות מתאימה לעור שומני, אני בודקת את העור שלך יחד איתך ומסבירה לך מראש מה הכי יתאים לך. חשוב לי שתהיי מרוצה מהתוצאה ושלא יהיו הפתעות."
    },
    {
      question: "יש אופציה לעשות מיקרופיגמנטציה בגבות ובשפתיים ביחד?",
      answer:<><div className={styles.description}> "בטח! והנה דוגמא חיה לאיך הטיפולים נראים ביחד"</div>
           <div className={styles.imageContainer}> <img className={styles.image} src={both}/> </div>
      </>
    },
    {
      question: "האם המיקרוטאצ' באמת מתאים לכל אחת?",
      answer: "לא, וחשוב לי להיות כנה איתך! המיקרוטאצ' מתאים רק למי שכבר יש לה בסיס של גבות יחסי ורוצה רק מילוי עדין בחורים קטנים. אם הגבות שלך דלילות מאוד או ויש הבדלי סימטריה מורגשים, נצטרך ללכת על הטיפול המלא. בשיחה הטלפונית ובפגישת הייעוץ אני אדע לאבחן בדיוק מה הכי מתאים לך."
    },
  ];

  return (
    <>
      <div className={styles.title}>שאלות תשובות</div>
      <div className={styles.description}>
        אני בטוחה שיש לך כמה שאלות שאת ממש רוצה לקבל עליהן תשובה עוד לפני שנשוחח - 
        אז ארגנתי כבר את התשובות שיעשו לך קצת סדר בראש
      </div>
      
      <div className={styles.faqContainer}>
        {faqData.map((item, index) => (
          <FAQItem 
            key={index}
            question={item.question}
            answer={item.answer}
          />
        ))}
      </div>
  
    </>
  );
};

export default ForthScreen;